# Pandas

## Series

In [1]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a' , 'b' , 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {
    'a' : 10,
    'b' : 20 ,
    'c' : 30
}

In [5]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(my_data ,  index = labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr , labels)  # Passing numpy arrays to create a list

a    10
b    20
c    30
dtype: int32

In [11]:
pd.Series(d)  # passing dictionary to create a Series. Dictionary key will be considered as Index

a    10
b    20
c    30
dtype: int64

In [14]:
ser1 = pd.Series([1,2,3,4] , index = ["USA" , "Germany" , "USSR" , "JAPAN"])

ser1

USA        1
Germany    2
USSR       3
JAPAN      4
dtype: int64

In [15]:
ser2 = pd.Series([1,2,3,4] , index = ["USA" , "Germany" , "Italy" , "JAPAN"])

ser2

USA        1
Germany    2
Italy      3
JAPAN      4
dtype: int64

In [16]:
ser1["USA"]

1

In [17]:
ser2["Italy"]

3

In [18]:
ser3 = pd.Series(data = labels)  # passing data as labels
ser3

0    a
1    b
2    c
dtype: object

In [19]:
ser1 + ser2

Germany    4.0
Italy      NaN
JAPAN      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrames

In [20]:
from numpy.random import randn
np.random.seed(101)

In [22]:
df = pd.DataFrame(randn(5,4) , index = ['A' , 'B' , 'C', 'D' , 'E'] , columns= ['W' , 'X','Y','Z'])

In [23]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
type(df['W'])

pandas.core.series.Series

In [30]:
df.W  # it will not work in case of space in column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [34]:
df[['W','Z']]  # returning Data Frame

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [36]:
df["New"] = df['W'] + df['Y']

In [37]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [40]:
df.drop("New" , axis = 1)  # for column, need to specify axis = 1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df  # column not dropped. Need to specify inplace parameter

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [42]:
df.drop("New" , axis = 1 , inplace= True)

In [43]:
df   # Now dropped

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df.drop("E" )  # E rows in dropped

# or

df.drop("E" , axis = 0)  # inplace parameter is not specified

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [48]:
df.shape  # returing tuple

(5, 4)

In [50]:
# Selecting rows

df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [51]:
df.loc[['A' , 'B']]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [53]:
df.loc[['A' , 'B']]['W']

A    2.706850
B    0.651118
Name: W, dtype: float64

In [54]:
df.iloc[1]

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [57]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [59]:
df.iloc[2]['W']

-2.0181682440373918

In [61]:
df.loc[['A' , 'B'] ,['W' , 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [62]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df > 0 # Return boolean DataFrame

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [65]:
booldf = df > 0
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [67]:
df[booldf]  # Nan for false values

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
df [df > 0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
df ['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [72]:
df[df['W'] > 0]  # only satisfied values will be return

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [73]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [76]:
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [79]:
df[(df['W'] > 0) | (df['Y'] > 1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [80]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [85]:
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [87]:
new_ind = ['CA' , 'NY' , 'WY' , 'OR' , 'CO']

new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [89]:
df['States']  = new_ind

In [90]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [92]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [1]:
import numpy as np
import pandas as pd

In [2]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [3]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [4]:
inside

[1, 2, 3, 1, 2, 3]

In [5]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [14]:
from numpy.random import randn
df = pd.DataFrame( randn(6,2) , hier_index, ['A','B'])
df

             A         B
G1 1  0.357343 -0.022757
   2 -0.784964  0.179941
   3 -0.214981  0.770632
G2 1 -0.234951  0.493764
   2 -0.982451  1.450048
   3 -1.677536 -0.189276

In [17]:
df.loc['G1']['A']

1    0.357343
2   -0.784964
3   -0.214981
Name: A, dtype: float64

In [18]:
df.loc['G1']

          A         B
1  0.357343 -0.022757
2 -0.784964  0.179941
3 -0.214981  0.770632

In [20]:
df.index.names

FrozenList([None, None])

In [21]:
df.index.names = ["Groups" , "Num"]

In [22]:
df

                   A         B
Groups Num
G1     1    0.357343 -0.022757
       2   -0.784964  0.179941
       3   -0.214981  0.770632
G2     1   -0.234951  0.493764
       2   -0.982451  1.450048
       3   -1.677536 -0.189276

In [24]:
df.loc['G2'].loc[2]['B']

1.4500484590968472

In [25]:
df.loc['G2']['B'].loc[2]

1.4500484590968472

In [26]:
df.xs

<bound method NDFrame.xs of                    A         B
Groups Num
G1     1    0.357343 -0.022757
       2   -0.784964  0.179941
       3   -0.214981  0.770632
G2     1   -0.234951  0.493764
       2   -0.982451  1.450048
       3   -1.677536 -0.189276>

In [27]:
df.xs('G1')

            A         B
Num
1    0.357343 -0.022757
2   -0.784964  0.179941
3   -0.214981  0.770632

In [28]:
df.xs(1, level = 'Num')

               A         B
Groups
G1      0.357343 -0.022757
G2     -0.234951  0.493764

In [29]:
d = {'A':[1,2,np.nan] , 'B':[5,np.nan,np.nan] , 'C':[1,2,3]}

In [30]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [31]:
df = pd.DataFrame(d)

In [32]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [33]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [34]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [35]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [36]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [38]:
df.fillna(99)

      A     B  C
0   1.0   5.0  1
1   2.0  99.0  2
2  99.0  99.0  3

In [40]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group BY

In [41]:
data = {
        'Company' : ['GOOG', 'GOOG', 'MSFT' ,'MSFT', 'FB' , 'FB'],
        'Person' : ['Sam' , 'Charlie', 'Amy' , 'Vanessa', 'Carl' ,'Sarah'],
        'Sales' : [200,120,340,124,243,350]
       }

In [42]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [44]:
df = pd.DataFrame(data)

In [45]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [48]:
bycomp = df.groupby('Company')

In [51]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [52]:
bycomp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [53]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [54]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [55]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [56]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [57]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [58]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [59]:
df.groupby('Company').describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [62]:
df.groupby('Company').describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                   \
          mean  ...      75%    max count   mean         std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  232.0  152.735065  124.0  178.0

Company
           50%    75%    max
Sales    232.0  286.0  340.0

[1 rows x 24 columns]

In [63]:
df.groupby('Company').describe().transpose()['FB']

       count   mean        std    min     25%    50%     75%    max
Sales    2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

## Mergining Joining and concatenating

In [64]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [65]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [66]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [67]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [68]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [69]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [70]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [71]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [72]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [73]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [74]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [75]:
pd.merge(left, right, how = 'inner' , on = 'key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

## Data input and output

In [77]:
pwd

'c:\\Pallav\\Python-Data-Science-and-Machine-Learning-Bootcamp\\DS_Practice_book'

In [78]:
import pandas as pd

In [100]:
df = pd.read_csv('C:/Pallav/Python-Data-Science-and-Machine-Learning-Bootcamp/Python-Data-Science-and-Machine-Learning-Bootcamp/Python-for-Data-Analysis/Pandas/Excel_Sample.csv' )

In [84]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [86]:
df.to_csv('C:/Pallav/Python-Data-Science-and-Machine-Learning-Bootcamp/Python-Data-Science-and-Machine-Learning-Bootcamp/Python-for-Data-Analysis/Pandas/My_output.csv' , index = False)

In [88]:
pd.read_excel('C:/Pallav/Python-Data-Science-and-Machine-Learning-Bootcamp/Python-Data-Science-and-Machine-Learning-Bootcamp/Python-for-Data-Analysis/Pandas/Excel_Sample.xlsx' , sheetname = 'Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [91]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [92]:
data

[                                             Bank Name                City  \
 0    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...           Milwaukee
 1                                       First NBC Bank         New Orleans
 2                                        Proficio Bank  Cottonwood Heights
 3                        Seaway Bank and Trust Company             Chicago
 4                               Harvest Community Bank          Pennsville
 5                                          Allied Bank            Mulberry
 6                         The Woodbury Banking Company            Woodbury
 7                               First CornerStone Bank     King of Prussia
 8                                   Trust Company Bank             Memphis
 9                           North Milwaukee State Bank           Milwaukee
 10                              Hometown National Bank            Longview
 11                                 The Bank of Georgia      Peachtree City
 12                                        Premier Bank              Denver
 13                                      Edgebrook Bank             Chicago
 14                              Doral Bank  En Espanol            San Juan
 15                   Capitol City Bank & Trust Company             Atlanta
 16                             Highland Community Bank             Chicago
 17                    First National Bank of Crestview           Crestview
 18                                  Northern Star Bank             Mankato
 19              Frontier Bank, FSB D/B/A El Paseo Bank         Palm Desert
 20               The National Republic Bank of Chicago             Chicago
 21                                      NBRS Financial          Rising Sun
 22                               GreenChoice Bank, fsb             Chicago
 23                            Eastside Commercial Bank             Conyers
 24                              The Freedom State Bank             Freedom
 25                                         Valley Bank     Fort Lauderdale
 26                                         Valley Bank              Moline
 27                         Slavie Federal Savings Bank             Bel Air
 28                               Columbia Savings Bank          Cincinnati
 29                        AztecAmerica Bank En Espanol              Berwyn
 ..                                                 ...                 ...
 522                                  ANB Financial, NA         Bentonville
 523                                          Hume Bank                Hume
 524                             Douglass National Bank         Kansas City
 525                                  Miami Valley Bank            Lakeview
 526                                            NetBank          Alpharetta
 527                          Metropolitan Savings Bank          Pittsburgh
 528                                    Bank of Ephraim             Ephraim
 529                                      Reliance Bank        White Plains
 530              Guaranty National Bank of Tallahassee         Tallahassee
 531                                Dollar Savings Bank              Newark
 532                               Pulaski Savings Bank        Philadelphia
 533              First National Bank of Blanchardville      Blanchardville
 534                              Southern Pacific Bank            Torrance
 535                        Farmers Bank of Cheneyville         Cheneyville
 536                                      Bank of Alamo               Alamo
 537             AmTrade International Bank  En Espanol             Atlanta
 538                     Universal Federal Savings Bank             Chicago
 539                       Connecticut Bank of Commerce            Stamford
 540                                   New Century Bank     Shelby Township
 541                              Net 1st National Bank          Boca Raton
 542                                       NextBank, NA             Phoenix
 543                           Oakwood Deposit Bank Co.             Oakwood
 544                              Bank of Sierra Blanca       Sierra Blanca
 545                      Hamilton Bank, NA  En Espanol               Miami
 546                             Sinclair National Bank            Gravette
 547                                 Superior Bank, FSB            Hinsdale
 548                                Malta National Bank               Malta
 549                    First Alliance Bank & Trust Co.          Manchester
 550                  National State Bank of Metropolis          Metropolis
 551                                   Bank of Honolulu            Honolulu

      ST   CERT                Acquiring Institution        Closing Date  \
 0    WI  30003  First-Citizens Bank & Trust Company         May 5, 2017
 1    LA  58302                         Whitney Bank      April 28, 2017
 2    UT  35495                    Cache Valley Bank       March 3, 2017
 3    IL  19328                  State Bank of Texas    January 27, 2017
 4    NJ  34951  First-Citizens Bank & Trust Company    January 13, 2017
 5    AR     91                         Today's Bank  September 23, 2016
 6    GA  11297                          United Bank     August 19, 2016
 7    PA  35312  First-Citizens Bank & Trust Company         May 6, 2016
 8    TN   9956           The Bank of Fayette County      April 29, 2016
 9    WI  20364  First-Citizens Bank & Trust Company      March 11, 2016
 10   WA  35156                       Twin City Bank     October 2, 2015
 11   GA  35259                        Fidelity Bank     October 2, 2015
 12   CO  34112            United Fidelity Bank, fsb       July 10, 2015
 13   IL  57772             Republic Bank of Chicago         May 8, 2015
 14   PR  32102         Banco Popular de Puerto Rico   February 27, 2015
 15   GA  33938  First-Citizens Bank & Trust Company   February 13, 2015
 16   IL  20290            United Fidelity Bank, fsb    January 23, 2015
 17   FL  17557                       First NBC Bank    January 16, 2015
 18   MN  34983                            BankVista   December 19, 2014
 19   CA  34738    Bank of Southern California, N.A.    November 7, 2014
 20   IL    916                  State Bank of Texas    October 24, 2014
 21   MD   4862                          Howard Bank    October 17, 2014
 22   IL  28462                 Providence Bank, LLC       July 25, 2014
 23   GA  58125            Community & Southern Bank       July 18, 2014
 24   OK  12483      Alva State Bank & Trust Company       June 27, 2014
 25   FL  21793  Landmark Bank, National Association       June 20, 2014
 26   IL  10450                  Great Southern Bank       June 20, 2014
 27   MD  32368                        Bay Bank, FSB        May 30, 2014
 28   OH  32284            United Fidelity Bank, fsb        May 23, 2014
 29   IL  57866             Republic Bank of Chicago        May 16, 2014
 ..   ..    ...                                  ...                 ...
 522  AR  33901       Pulaski Bank and Trust Company         May 9, 2008
 523  MO   1971                        Security Bank       March 7, 2008
 524  MO  24660       Liberty Bank and Trust Company    January 25, 2008
 525  OH  16848         The Citizens Banking Company     October 4, 2007
 526  GA  32575                           ING DIRECT  September 28, 2007
 527  PA  35353  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 528  UT   1249                        Far West Bank       June 25, 2004
 529  NY  26778                     Union State Bank      March 19, 2004
 530  FL  26838              Hancock Bank of Florida      March 12, 2004
 531  NJ  31330                          No Acquirer   February 14, 2004
 532  PA  27203                       Earthstar Bank   November 14, 2003
 533  WI  11639                        The Park Bank         May 9, 2003
 534  CA  27094                            Beal Bank    February 7, 2003
 535  LA  16445            Sabine State Bank & Trust   December 17, 2002
 536  TN   9961                          No Acquirer    November 8, 2002
 537  GA  33784                          No Acquirer  September 30, 2002
 538  IL  29355               Chicago Community Bank       June 27, 2002
 539  CT  19183                   Hudson United Bank       June 26, 2002
 540  MI  34979                          No Acquirer      March 28, 2002
 541  FL  26652                       Bank Leumi USA       March 1, 2002
 542  AZ  22314                          No Acquirer    February 7, 2002
 543  OH   8966       The State Bank & Trust Company    February 1, 2002
 544  TX  22002     The Security State Bank of Pecos    January 18, 2002
 545  FL  24382     Israel Discount Bank of New York    January 11, 2002
 546  AR  34248                   Delta Trust & Bank   September 7, 2001
 547  IL  32646                Superior Federal, FSB       July 27, 2001
 548  OH   6629                    North Valley Bank         May 3, 2001
 549  NH  34264  Southern New Hampshire Bank & Trust    February 2, 2001
 550  IL   3815              Banterra Bank of Marion   December 14, 2000
 551  HI  21029                   Bank of the Orient    October 13, 2000

            Updated Date
 0          May 11, 2017
 1          May 10, 2017
 2        April 13, 2017
 3        April 21, 2017
 4        April 13, 2017
 5     November 17, 2016
 6        April 27, 2017
 7     September 6, 2016
 8     September 6, 2016
 9        March 13, 2017
 10       April 13, 2016
 11     October 24, 2016
 12      August 17, 2016
 13        July 12, 2016
 14         May 13, 2015
 15       April 21, 2015
 16       April 21, 2015
 17          May 8, 2017
 18      January 6, 2016
 19    November 10, 2016
 20      January 6, 2016
 21       March 26, 2015
 22    December 12, 2016
 23        July 11, 2016
 24       March 25, 2016
 25        June 29, 2015
 26        June 26, 2015
 27    December 12, 2016
 28    November 10, 2016
 29     October 20, 2016
 ..                  ...
 522     August 28, 2012
 523     August 28, 2012
 524    October 26, 2012
 525  September 12, 2016
 526     August 28, 2012
 527    October 27, 2010
 528       April 9, 2008
 529       April 9, 2008
 530        June 5, 2012
 531       April 9, 2008
 532       July 22, 2005
 533        June 5, 2012
 534    October 20, 2008
 535    October 20, 2004
 536      March 18, 2005
 537  September 11, 2006
 538       April 9, 2008
 539   February 14, 2012
 540      March 18, 2005
 541       April 9, 2008
 542    February 5, 2015
 543    October 25, 2012
 544    November 6, 2003
 545  September 21, 2015
 546   February 10, 2004
 547     August 19, 2014
 548   November 18, 2002
 549   February 18, 2003
 550      March 17, 2005
 551      March 17, 2005

 [552 rows x 7 columns]]

In [93]:
type(data)

list

In [95]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","May 11, 2017"
1,First NBC Bank,New Orleans,LA,58302,Whitney Bank,"April 28, 2017","May 10, 2017"
2,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,"March 3, 2017","April 13, 2017"
3,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","April 21, 2017"
4,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017","April 13, 2017"

In [96]:
from sqlalchemy import create_engine

In [98]:
engine = create_engine('sqlite:///:memory:')

In [101]:
df.to_sql('my_table' , engine)

In [102]:
sqldf = pd.read_sql('my_table' , engine)

In [103]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

# Exercise

In [104]:
# Import pandas as pd.

import pandas as pd

In [106]:
#Read Salaries.csv as a dataframe called sal.

sal = pd.read_csv('C:\Pallav\Python-Data-Science-and-Machine-Learning-Bootcamp\Python-Data-Science-and-Machine-Learning-Bootcamp\Python-for-Data-Analysis\Pandas\Pandas Exercises\Salaries.csv')

In [107]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [108]:
#Use the .info() method to find out how many entries there are.

sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
Id                  148654 non-null int64
EmployeeName        148654 non-null object
JobTitle            148654 non-null object
BasePay             148045 non-null float64
OvertimePay         148650 non-null float64
OtherPay            148650 non-null float64
Benefits            112491 non-null float64
TotalPay            148654 non-null float64
TotalPayBenefits    148654 non-null float64
Year                148654 non-null int64
Notes               0 non-null float64
Agency              148654 non-null object
Status              0 non-null float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [112]:
#What is the average BasePay ?

sal['BasePay'].mean()

66325.44884050643

In [114]:
#What is the highest amount of OvertimePay in the dataset ?

sal.columns

sal['OvertimePay'].max()

245131.88

In [115]:
sal.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [121]:
#What is the job title of JOSEPH DRISCOLL ? 
#Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll).

sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [125]:
#How much does JOSEPH DRISCOLL make (including benefits)?

sal[sal['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [133]:
# What is the name of highest paid person (including benefits)?

sal[ sal['TotalPayBenefits']  == sal['TotalPayBenefits'].max() ]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [135]:
#What is the name of lowest paid person (including benefits)? 
#Do you notice something strange about how much he or she is paid?

sal[ sal['TotalPayBenefits']  == sal['TotalPayBenefits'].min() ]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [138]:
#What was the average (mean) BasePay of all employees per year? (2011-2014) ?


sal.groupby('Year')['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [139]:
#How many unique job titles are there?

sal['JobTitle'].nunique()

2159

In [140]:
#What are the top 5 most common jobs?

sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [183]:
# How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)

sum(sal[sal['Year'] == 2013]['JobTitle'].value_counts() == 1 )

202

In [205]:
# How many people have the word Chief in their job title? (This is pretty tricky)

sal[sal['JobTitle'].str.lower().str.contains('chief')].count()

Id                  627
EmployeeName        627
JobTitle            627
BasePay             624
OvertimePay         627
OtherPay            627
Benefits            423
TotalPay            627
TotalPayBenefits    627
Year                627
Notes                 0
Agency              627
Status                0
Len_of_jobtitle     627
dtype: int64

In [213]:
# Bonus: Is there a correlation between length of the Job Title string and Salary?

sal['Len_of_jobtitle'] = sal['JobTitle'].apply(len)
sal
sal[['TotalPayBenefits' , 'Len_of_jobtitle'  ]].corr()

                  TotalPayBenefits  Len_of_jobtitle
TotalPayBenefits          1.000000        -0.036878
Len_of_jobtitle          -0.036878         1.000000

# Ecommerce Purchases Exercise

In [215]:
## Import pandas and read in the Ecommerce Purchases csv file and set it to a DataFrame called ecom.

ecom = pd.read_csv("C:\Pallav\Python-Data-Science-and-Machine-Learning-Bootcamp\Python-Data-Science-and-Machine-Learning-Bootcamp\Python-for-Data-Analysis\Pandas\Pandas Exercises\Ecommerce Purchases")

ecom.head()

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [216]:
#How many rows and columns are there?

ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
Address             10000 non-null object
Lot                 10000 non-null object
AM or PM            10000 non-null object
Browser Info        10000 non-null object
Company             10000 non-null object
Credit Card         10000 non-null int64
CC Exp Date         10000 non-null object
CC Security Code    10000 non-null int64
CC Provider         10000 non-null object
Email               10000 non-null object
Job                 10000 non-null object
IP Address          10000 non-null object
Language            10000 non-null object
Purchase Price      10000 non-null float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

In [219]:
# What is the average Purchase Price?

ecom.columns

ecom['Purchase Price'].mean()

50.34730200000025

In [220]:
#What were the highest and lowest purchase prices?
ecom['Purchase Price'].max()

99.989999999999995

In [221]:
ecom['Purchase Price'].min()

0.0

In [228]:
# How many people have English 'en' as their Language of choice on the website?

ecom.columns

ecom[ecom['Language'] == 'en'].count()

Address             1098
Lot                 1098
AM or PM            1098
Browser Info        1098
Company             1098
Credit Card         1098
CC Exp Date         1098
CC Security Code    1098
CC Provider         1098
Email               1098
Job                 1098
IP Address          1098
Language            1098
Purchase Price      1098
dtype: int64

In [230]:
# How many people have the job title of "Lawyer" ?

ecom[ecom['Job'] == 'Lawyer'].info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30 entries, 470 to 9979
Data columns (total 14 columns):
Address             30 non-null object
Lot                 30 non-null object
AM or PM            30 non-null object
Browser Info        30 non-null object
Company             30 non-null object
Credit Card         30 non-null int64
CC Exp Date         30 non-null object
CC Security Code    30 non-null int64
CC Provider         30 non-null object
Email               30 non-null object
Job                 30 non-null object
IP Address          30 non-null object
Language            30 non-null object
Purchase Price      30 non-null float64
dtypes: float64(1), int64(2), object(11)
memory usage: 3.5+ KB

In [232]:
# How many people made the purchase during the AM and how many people made the purchase during PM ?

ecom['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

In [234]:
# What are the 5 most common Job Titles?

ecom['Job'].value_counts().head(5)

Interior and spatial designer        31
Lawyer                               30
Social researcher                    28
Research officer, political party    27
Designer, jewellery                  27
Name: Job, dtype: int64

In [239]:
# Someone made a purchase that came from Lot: "90 WT" , what was the Purchase Price for this transaction?

ecom.columns

ecom[ecom['Lot'] == '90 WT']['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

In [248]:
# What is the email of the person with the following Credit Card Number: 4926535242672853

#ecom.info()


ecom[ecom['Credit Card'] == 4926535242672853]['Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

In [282]:
# How many people have American Express as their Credit Card Provider and made a purchase above $95 ?
#ecom.columns
#ecom.columns
#ecom[ecom[ecom['CC Provider'] == 'American Express' ]['Purchase Price'] > 95 ]

ecom[ (ecom['Purchase Price'] > 95) & ( ecom['CC Provider'] == 'American Express' ) ].count()

Address             39
Lot                 39
AM or PM            39
Browser Info        39
Company             39
Credit Card         39
CC Exp Date         39
CC Security Code    39
CC Provider         39
Email               39
Job                 39
IP Address          39
Language            39
Purchase Price      39
dtype: int64

In [302]:
# Hard: How many people have a credit card that expires in 2025?

#ecom.info()

len(ecom[ecom['CC Exp Date'].apply(lambda  exp : exp[3:] == '25')].index)

1033

In [330]:
# Hard: What are the top 5 most popular email providers/hosts (e.g. gmail.com, yahoo.com, etc...)

#ecom.columns

ecom['Email'].apply(lambda email : email.split('@')[1]).value_counts().head(5)

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Email, dtype: int64